ErpTest/src/BusinessProcesses/уатСогласование/уатСогласование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>уатСогласование</name>
  <comment>(уат)</comment>
  <basedOn>Document.уатВводВЭксплуатациюТСиОборудования</basedOn>
  <basedOn>Document.уатВыбытиеТСиОборудования</basedOn>
  <basedOn>Document.уатПеремещениеТСиОборудования</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.уатВажность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСогласования</name>
    <type>
      <types>EnumRef.уатВариантыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИтерации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторитьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.уатУстановкаТарифовЗП</types>
      <types>DocumentRef.уатУстановкаПрейскурантовТС</types>
      <types>DocumentRef.уатПеремещениеТСиОборудования</types>
      <types>DocumentRef.уатВводВЭксплуатациюТСиОборудования</types>
      <types>DocumentRef.уатВыбытиеТСиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.уатРезультатыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.уатШаблоныСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыСогласования</name>
    <attributes>
      <name>ЗадачаИсполнителя</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИтерации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСогласования</name>
      <type>
        <types>EnumRef.уатРезультатыСогласования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыОзнакомлений</name>
    <attributes>
      <name>ЗадачаИсполнителя</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИтерации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленоНаПовторноеСогласование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

ErpTest/src/BusinessProcesses/уатСогласование/Forms/ФормаБизнесПроцесса/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновлениеОтображения()
	Если Объект.Стартован Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаВариант.Доступность = Ложь;
		Элементы.ФормаЗаполнитьПоШаблону.Доступность = Ложь;
	КонецЕсли;
	//Если Важность = Перечисления.уатВажность.Высокая Тогда
	//	Элементы.Важность.ЦветТекста = WebЦвета.Красный;
	//ИначеЕсли Важность = Перечисления.уатВажность.Низкая Тогда
	//	Элементы.Важность.ЦветТекста = WebЦвета.Серый;
	//Иначе
	//	Элементы.Важность.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	//КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Карта(Команда)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("БизнесПроцесс.уатСогласование.Форма.КартаМаршрута", Новый Структура("БизнесПроцесс", Объект.Ссылка), ЭтаФорма);
	Иначе
		Сообщить("Бизнес-процесс не записан!", СтатусСообщения.Внимание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	РезультатВыбора = Неопределено;

	ОткрытьФорму("Справочник.уатШаблоныСогласования.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ЗаполнитьПоШаблонуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатВыбора = Результат;
    Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.уатШаблоныСогласования") И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(РезультатВыбора, "ЭтоГруппа") = ЛОЖЬ Тогда 
        ЗаполнитьПоШаблонуСервер(РезультатВыбора);
        Модифицированность = Истина;
    КонецЕсли;

КонецПроцедуры

&НаСервере                                           
Процедура ЗаполнитьПоШаблонуСервер(Шаблон)
	СогласованиеОбъект = РеквизитФормыВЗначение("Объект");
	СогласованиеОбъект.ЗаполнитьПоШаблону(Шаблон);
	ЗначениеВРеквизитФормы(СогласованиеОбъект, "Объект");
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ  

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(Новый ОписаниеОповещения("ВсеЗадачиПередНачаломИзмененияЗавершение", ЭтотОбъект), Элементы.ВсеЗадачи.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзмененияЗавершение(ДополнительныеПараметры) Экспорт
	
	Заглушка = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Предмет) И (НЕ ЗначениеЗаполнено(Объект.Наименование) ИЛИ Объект.Наименование = "Согласовать ") Тогда 
		Объект.Наименование = "Согласовать """ + Объект.Предмет + """";
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("БизнесПроцессИзменен", Объект.Ссылка);
	Если Объект.Стартован Тогда
		Оповестить("БизнесПроцессСтартован", Объект.Ссылка);
	КонецЕсли;
	
	ОбновлениеОтображения();
КонецПроцедуры
